tests/fixtures/xml/fake_envConsulta.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1 = "http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/consulta/retornoProcessamento/v1_1_0" ><soapenv:Header/><soapenv:Body><v1:ConsultarLoteEventos><v1:consulta><eSocial xmlns="http://www.esocial.gov.br/schema/lote/eventos/envio/consulta/retornoProcessamento/v1_0_0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><consultaLoteEventos><protocoloEnvio>1.2.201707.0000000000000007638</protocoloEnvio></consultaLoteEventos></eSocial></v1:consulta></v1:ConsultarLoteEventos></soapenv:Body></soapenv:Envelope>